---
kind: property
id: P:Autodesk.Revit.UI.DockablePaneState.MinimumHeight
source: html/09e43d6f-77c2-0c81-654a-47a135280d43.htm
---
# Autodesk.Revit.UI.DockablePaneState.MinimumHeight Property

When %dockPosition% is anything other than floating, the minimum height to use for the pane. Default is 200 pixels.

## Syntax (C#)
```csharp
public int MinimumHeight { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: The given value for minimumHeight is not positive.